{"backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 96, 96, 1], "padding": "valid", "use_bias": true, "dtype": "float32", "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activity_regularizer": null, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 100, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 30, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "trainable": true, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_6", "trainable": true}}]}